package bolola;

public class Boloa {
    public static void main(String[] args) {
        char[] bolola = {'b', 'o', 'l', 'o', 'l', 'a'};

//        2) Ունենք հետևյալ մասիվը՝
//        char[] bolola = {'b','o','l','o','l','a'};
//        ունենք նաև մի սինվոլ՝ char c = 'o';
//        Պետք է գրել լոգիկա, որը կհաշվի թե քանի հատ կա c-փոփոխականից մեր մասիվի մեջ, ու տպել այդ քանակը։

        char c = 'o';
        int x = 0;
        for (int i = 0; i < bolola.length; i++) {
            if (c == bolola[i]) {
                x++;
            }
        }
        System.out.println(x);
    }


//        3) Ունենք հետևյալ մասիվը՝
//        char[] bolola = {'b','o','l','o','l','a'};
//        պետք է գրել կոդ, որը կտպի մեջտեղի 2 սինվոլները։








//        4) Ունենք հետևյալ մասիվը՝
//        char[] bolola = {'b','o','l','o','l','a'};
//        պետք է տպենք true եթե մեր մասիվը վերջանում է ly-ով, եթե ոչ՝ false
//        5) Ունենք հետևյալ մասիվը՝
//        char[] bolola = {'b','a',b','o','l','a'};
////Տպում ենք true եթե տեքստը պարունակում է bob բառը, բայց o-ի տեղը կարող է լինել ցանկացած սինվոլ։
////օր․ abcbob → true, b9b -> true, բայց ասենք bac-> false
//                Առայժմ այսքանը։ Դե եթե մի կլասսի մեջ եք գրում, մասիվի անունները տարբեր կդնեք, որ կոնֆլիկտ չտա։
}

